@kalilsn Here's the terraform plan:

```shell
Terraform will perform the following actions:

  # module.deployment.module.core_dependency_services.aws_secretsmanager_secret.datacite_password will be created
  + resource "aws_secretsmanager_secret" "datacite_password" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "datacite-password-stevie-production"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # module.deployment.module.core_dependency_services.aws_secretsmanager_secret.datacite_repository_id will be created
  + resource "aws_secretsmanager_secret" "datacite_repository_id" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "datacite-repository-id-stevie-production"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # module.deployment.module.service_core.module.ecs_service.data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "stevie-core"
      + task_role_arn        = (known after apply)
    }

  # module.deployment.module.service_core.module.ecs_service.aws_ecs_task_definition.this[0] must be replaced
+/- resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:us-east-1:246372085946:task-definition/stevie-core:191" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:246372085946:task-definition/stevie-core" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - dependsOn              = [
                      - {
                          - condition     = "SUCCESS"
                          - containerName = "migrations"
                        },
                    ]
                  - environment            = [
                      - {
                          - name  = "ASSETS_BUCKET_NAME"
                          - value = "assets.app.pubpub.org"
                        },
                      - {
                          - name  = "ASSETS_REGION"
                          - value = "us-east-1"
                        },
                      - {
                          - name  = "ASSETS_UPLOAD_KEY"
                          - value = "AKIATSXHLWC5ORF73VHS"
                        },
                      - {
                          - name  = "HOSTNAME"
                          - value = "0.0.0.0"
                        },
                      - {
                          - name  = "MAILGUN_SMTP_HOST"
                          - value = "smtp.mailgun.org"
                        },
                      - {
                          - name  = "MAILGUN_SMTP_PORT"
                          - value = "465"
                        },
                      - {
                          - name  = "MAILGUN_SMTP_USERNAME"
                          - value = "v7@mg.pubpub.org"
                        },
                      - {
                          - name  = "NEXT_PUBLIC_PUBPUB_URL"
                          - value = "https://app.pubpub.org"
                        },
                      - {
                          - name  = "NEXT_PUBLIC_SUPABASE_PUBLIC_KEY"
                          - value = "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZSIsInJlZiI6ImRzbGVxanV2enVveWNwZW90ZHdzIiwicm9sZSI6ImFub24iLCJpYXQiOjE2ODIzNTE0MjEsImV4cCI6MTk5NzkyNzQyMX0.3HHC0f7zlFXP77N0U8cS3blr7n6hhjqdYI6_ciQJams"
                        },
                      - {
                          - name  = "NEXT_PUBLIC_SUPABASE_URL"
                          - value = "https://dsleqjuvzuoycpeotdws.supabase.co"
                        },
                      - {
                          - name  = "OTEL_SERVICE_NAME"
                          - value = "core.core"
                        },
                      - {
                          - name  = "PGDATABASE"
                          - value = "stevie_production_core_postgres"
                        },
                      - {
                          - name  = "PGHOST"
                          - value = "stevie-core-postgres-production.cc1xafkddg79.us-east-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "PGPORT"
                          - value = "5432"
                        },
                      - {
                          - name  = "PGUSER"
                          - value = "stevie"
                        },
                      - {
                          - name  = "PUBPUB_URL"
                          - value = "https://app.pubpub.org"
                        },
                      - {
                          - name  = "SUPABASE_PUBLIC_KEY"
                          - value = "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZSIsInJlZiI6ImRzbGVxanV2enVveWNwZW90ZHdzIiwicm9sZSI6ImFub24iLCJpYXQiOjE2ODIzNTE0MjEsImV4cCI6MTk5NzkyNzQyMX0.3HHC0f7zlFXP77N0U8cS3blr7n6hhjqdYI6_ciQJams"
                        },
                      - {
                          - name  = "SUPABASE_URL"
                          - value = "https://dsleqjuvzuoycpeotdws.supabase.co"
                        },
                    ]
                  - essential              = true
                  - image                  = "246372085946.dkr.ecr.us-east-1.amazonaws.com/pubpub-v7-core:latest"
                  - interactive            = false
                  - linuxParameters        = {
                      - initProcessEnabled = true
                    }
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "stevie-ecs-production-container-logs"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints            = []
                  - name                   = "core"
                  - portMappings           = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - name          = "core"
                          - protocol      = "tcp"
                        },
                    ]
                  - privileged             = false
                  - pseudoTerminal         = false
                  - readonlyRootFilesystem = false
                  - secrets                = [
                      - {
                          - name      = "API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:api-key-stevie-production-11R0K0"
                        },
                      - {
                          - name      = "ASSETS_UPLOAD_SECRET_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:asset-uploader-secret-key-stevie-production-hZOJCl"
                        },
                      - {
                          - name      = "HONEYCOMB_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:honeycombio-apikey-stevie-production-0BynA5"
                        },
                      - {
                          - name      = "JWT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:jwt-secret-stevie-production-vly0y0"
                        },
                      - {
                          - name      = "MAILGUN_SMTP_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:mailgun-smtp-password-stevie-production-CHbvhk"
                        },
                      - {
                          - name      = "PGPASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:rds-db-password-stevie-production-GI4oxb"
                        },
                      - {
                          - name      = "SENTRY_AUTH_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:sentry-auth-token-stevie-production-GI4oxb"
                        },
                      - {
                          - name      = "SUPABASE_SERVICE_ROLE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:supabase-service-role-key-stevie-production-Wzfwj5"
                        },
                      - {
                          - name      = "SUPABASE_WEBHOOKS_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:supabase-webhooks-api-key-stevie-production-DNqFhc"
                        },
                    ]
                  - startTimeout           = 30
                  - stopTimeout            = 120
                  - systemControls         = []
                  - user                   = "0"
                  - volumesFrom            = []
                },
              - {
                  - command                = [
                      - "pnpm",
                      - "--filter",
                      - "core",
                      - "migrate-docker",
                    ]
                  - environment            = [
                      - {
                          - name  = "ASSETS_BUCKET_NAME"
                          - value = "assets.app.pubpub.org"
                        },
                      - {
                          - name  = "ASSETS_REGION"
                          - value = "us-east-1"
                        },
                      - {
                          - name  = "ASSETS_UPLOAD_KEY"
                          - value = "AKIATSXHLWC5ORF73VHS"
                        },
                      - {
                          - name  = "HOSTNAME"
                          - value = "0.0.0.0"
                        },
                      - {
                          - name  = "MAILGUN_SMTP_HOST"
                          - value = "smtp.mailgun.org"
                        },
                      - {
                          - name  = "MAILGUN_SMTP_PORT"
                          - value = "465"
                        },
                      - {
                          - name  = "MAILGUN_SMTP_USERNAME"
                          - value = "v7@mg.pubpub.org"
                        },
                      - {
                          - name  = "NEXT_PUBLIC_PUBPUB_URL"
                          - value = "https://app.pubpub.org"
                        },
                      - {
                          - name  = "NEXT_PUBLIC_SUPABASE_PUBLIC_KEY"
                          - value = "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZSIsInJlZiI6ImRzbGVxanV2enVveWNwZW90ZHdzIiwicm9sZSI6ImFub24iLCJpYXQiOjE2ODIzNTE0MjEsImV4cCI6MTk5NzkyNzQyMX0.3HHC0f7zlFXP77N0U8cS3blr7n6hhjqdYI6_ciQJams"
                        },
                      - {
                          - name  = "NEXT_PUBLIC_SUPABASE_URL"
                          - value = "https://dsleqjuvzuoycpeotdws.supabase.co"
                        },
                      - {
                          - name  = "OTEL_SERVICE_NAME"
                          - value = "core.migrations"
                        },
                      - {
                          - name  = "PGDATABASE"
                          - value = "stevie_production_core_postgres"
                        },
                      - {
                          - name  = "PGHOST"
                          - value = "stevie-core-postgres-production.cc1xafkddg79.us-east-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "PGPORT"
                          - value = "5432"
                        },
                      - {
                          - name  = "PGUSER"
                          - value = "stevie"
                        },
                      - {
                          - name  = "PUBPUB_URL"
                          - value = "https://app.pubpub.org"
                        },
                      - {
                          - name  = "SUPABASE_PUBLIC_KEY"
                          - value = "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZSIsInJlZiI6ImRzbGVxanV2enVveWNwZW90ZHdzIiwicm9sZSI6ImFub24iLCJpYXQiOjE2ODIzNTE0MjEsImV4cCI6MTk5NzkyNzQyMX0.3HHC0f7zlFXP77N0U8cS3blr7n6hhjqdYI6_ciQJams"
                        },
                      - {
                          - name  = "SUPABASE_URL"
                          - value = "https://dsleqjuvzuoycpeotdws.supabase.co"
                        },
                    ]
                  - essential              = false
                  - image                  = "246372085946.dkr.ecr.us-east-1.amazonaws.com/pubpub-v7:latest"
                  - interactive            = false
                  - linuxParameters        = {
                      - initProcessEnabled = true
                    }
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "stevie-ecs-production-container-logs"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints            = []
                  - name                   = "migrations"
                  - portMappings           = []
                  - privileged             = false
                  - pseudoTerminal         = false
                  - readonlyRootFilesystem = false
                  - secrets                = [
                      - {
                          - name      = "API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:api-key-stevie-production-11R0K0"
                        },
                      - {
                          - name      = "ASSETS_UPLOAD_SECRET_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:asset-uploader-secret-key-stevie-production-hZOJCl"
                        },
                      - {
                          - name      = "HONEYCOMB_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:honeycombio-apikey-stevie-production-0BynA5"
                        },
                      - {
                          - name      = "JWT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:jwt-secret-stevie-production-vly0y0"
                        },
                      - {
                          - name      = "MAILGUN_SMTP_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:mailgun-smtp-password-stevie-production-CHbvhk"
                        },
                      - {
                          - name      = "PGPASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:rds-db-password-stevie-production-GI4oxb"
                        },
                      - {
                          - name      = "SENTRY_AUTH_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:sentry-auth-token-stevie-production-GI4oxb"
                        },
                      - {
                          - name      = "SUPABASE_SERVICE_ROLE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:supabase-service-role-key-stevie-production-Wzfwj5"
                        },
                      - {
                          - name      = "SUPABASE_WEBHOOKS_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:246372085946:secret:supabase-webhooks-api-key-stevie-production-DNqFhc"
                        },
                    ]
                  - startTimeout           = 30
                  - stopTimeout            = 120
                  - systemControls         = []
                  - user                   = "0"
                  - volumesFrom            = []
                },
              - {
                  - environment            = [
                      - {
                          - name  = "NGINX_LISTEN_PORT"
                          - value = "8080"
                        },
                      - {
                          - name  = "NGINX_PREFIX"
                          - value = "/"
                        },
                      - {
                          - name  = "NGINX_UPSTREAM_HOST"
                          - value = "127.0.0.1"
                        },
                      - {
                          - name  = "NGINX_UPSTREAM_PORT"
                          - value = "3000"
                        },
                      - {
                          - name  = "OTEL_SERVICE_NAME"
                          - value = "core.nginx"
                        },
                    ]
                  - essential              = true
                  - image                  = "246372085946.dkr.ecr.us-east-1.amazonaws.com/nginx:latest"
                  - interactive            = false
                  - linuxParameters        = {
                      - initProcessEnabled = true
                    }
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "stevie-ecs-production-container-logs"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints            = []
                  - name                   = "nginx"
                  - portMappings           = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - name          = "core-nginx"
                          - protocol      = "tcp"
                        },
                    ]
                  - privileged             = false
                  - pseudoTerminal         = false
                  - readonlyRootFilesystem = false
                  - startTimeout           = 30
                  - stopTimeout            = 120
                  - systemControls         = []
                  - user                   = "0"
                  - volumesFrom            = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "stevie-core" -> (known after apply)
      ~ revision                 = 191 -> (known after apply)
        tags                     = {
            "Environment"         = "stevie-production"
            "LogicalName"         = "core"
            "Project"             = "Pubpub-v7"
            "Shortname"           = "94a0"
            "ShortnameAnnotation" = "Shortname is calculated as first four characters of the sha1sum of the Logical Name."
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
``` 